Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: གང་དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: That being the case, what can be said of accomplishing it in actuality?

source: བློ་གྲོས་རྒྱ་མཚོ་ཟང་ཟིང་གི་སྦྱིན་པ་དེ་ཐམས་ཅད་ནི་འཇིག་རྟེན་ལ་བསྟེན་པའོ། །
en: Sāgaramati, all material giving depends on the world.

source: ཆོས་ཀྱི་སྦྱིན་པ་འདི་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བར་འགྱུར་བའོ། །
en: Giving Dharma, on the other hand, transcends the world entirely.

source: བློ་གྲོས་རྒྱ་མཚོ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ནི། ཡོངས་སུ་བཟུང་བ་བཞི་རབ་ཏུ་འཐོབ་སྟེ།
en: “Sāgaramati, upholding the sublime Dharma means that one will acquire four kinds of care.

source: སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་རབ་ཏུ་འཐོབ་པ་དང་། ལྷས་ཡོངས་སུ་བཟུང་བ་དང་། བསོད་ནམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་དང་། ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་འཐོབ་པའོ། །
en: One will acquire the care of the buddhas, the care of the gods, the care of merit, and the care of wisdom.

source: བློ་གྲོས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཁྱད་པར་དུ་འགྱུར་བ་བཞི་སྟེ།
en: “Sāgaramati, there are four things that distinguish bodhisattvas who are sustained by the buddhas.

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མི་འབྲལ་བར་འགྱུར་བ་དང་། དེ་ལ་བདུད་ཐམས་ཅད་ཀྱིས་གླགས་མི་རྙེད་པར་འགྱུར་བ་དང་། གཟུངས་རབ་ཏུ་ཐོབ་པས་མི་ཟད་པར་འགྱུར་བ་དང་། མངོན་པར་ཤེས་པ་མྱུར་ཏེ་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་འགྱུར་བ་སྟེ།
en: (1) They will never cease seeing the thus-gone ones, (2) no māra will ever affect them, (3) they will achieve recollection and become inexhaustible, and (4) they will attain super-knowledge and the irreversible level.

source: བློ་གྲོས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཁྱད་པར་དུ་འགྱུར་བ་བཞི་པོ་དེ་དག་གོ། །
en: Sāgaramati, these are the four things that distinguish bodhisattvas who are being cared for by the buddhas.

source: བློ་གྲོས་རྒྱ་མཚོ་ལྷས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དག་པར་འགྱུར་བ་བཞི་སྟེ།
en: “Sāgaramati, there are four ways in which bodhisattvas who are sustained by the gods will be purified.

source: ལྷ་རྣམས་ཀྱིས་དེའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམ་པར་སྦྱོང་བ་དང་། ཆོས་མཉན་པ་ལ་སེམས་རྩེ་གཅིག་ཏུ་བྱ་བར་འཇོག་པ་དང་། དེ་ལ་ཕ་རོལ་གྱི་གནོད་པ་ཐམས་ཅད་མི་འབྱུང་བར་བྱེད་པ་དང་། དེ་ལ་སེམས་མ་དད་པ་ཐམས་ཅད་ཀྱང་ལྷ་རྣམས་ཀྱི་དབང་གིས་དད་པར་བྱེད་པ་སྟེ།
en: (1) The gods will purify their assembly, (2) inspire them to study the Dharma with a one-pointed mind, (3) ensure that no external adversity occurs, and (4) create faith in all who do not have faith in them.

source: བློ་གྲོས་རྒྱ་མཚོ་ལྷས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དག་པར་འགྱུར་བ་བཞི་པོ་དེ་དག་གོ། །
en: Sāgaramati, these are the four ways in which bodhisattvas who are being cared for by the gods will be purified.

source: བློ་གྲོས་རྒྱ་མཚོ་བསོད་ནམས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྒྱན་དུ་འགྱུར་བ་བཞི་སྟེ།
en: “Sāgaramati, there are four ways in which bodhisattvas who are sustained by merit will be adorned.

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པས་ལུས་ཀྱི་རྒྱན་དང་། སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱེད་པས་ངག་གི་རྒྱན་དང་། བྱ་བ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པས་ཞིང་གི་རྒྱན་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་དུ་སྐྱེ་བ་རབ་ཏུ་ཐོབ་པས་སྐྱེ་བའི་རྒྱན་ཏེ།
en: (1) Their bodies will be adorned by accomplishing the major and minor marks of perfection. (2) Their speech will be adorned by pleasing all beings. (3) Their realms will be adorned by displaying all kinds of actions. (4) Their rebirths will be adorned by attaining rebirth as Śakra, Brahmā, and the world protectors.

source: བློ་གྲོས་རྒྱ་མཚོ་བསོད་ནམས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྒྱན་དུ་འགྱུར་བ་བཞི་པོ་དེ་དག་གོ། །
en: Sāgaramati, these are the four ways in which bodhisattvas who are being cared for by merit will be adorned.

source: བློ་གྲོས་རྒྱ་མཚོ་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྣང་བར་འགྱུར་བ་བཞི་སྟེ།
en: “Sāgaramati, there are four ways in which bodhisattvas who are sustained by wisdom will illuminate.

source: སོ་སོར་ཅི་རིགས་པར་ཆོས་སྟོན་པས་སེམས་ཅན་གྱི་དབང་པོ་སྣང་བ་དང་། ཆོས་ཀྱི་སྨན་ཡང་དག་པར་སྦྱོར་བས་ཉོན་མོངས་པའི་ནད་ཐམས་ཅད་སྣང་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་འགྲོ་བས་མངོན་པར་ཤེས་པ་སྣང་བ་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པས་ཆོས་ཀྱི་དབྱིངས་སྣང་བ་སྟེ།
en: (1) By teaching the Dharma that is appropriate for each individual, they will illuminate the faculties of beings. (2) By preparing the medicine of Dharma, they will illuminate the diseases of the afflictions. (3) By traveling to other buddha realms, they will illuminate super-knowledge. (4) By knowing all phenomena just as they are, they will illuminate the realm of phenomena.

source: བློ་གྲོས་རྒྱ་མཚོ་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྣང་བར་འགྱུར་བ་བཞི་པོ་དེ་དག་གོ། །
en: Sāgaramati, these are the four ways in which bodhisattvas who are being cared for by wisdom will illuminate.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་གྱི་ཕན་ཡོན་འདི་དག་ཡོངས་སུ་འཛིན་པར་འདོད་པས་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: “Sāgaramati, thus a bodhisattva great being who yearns to possess these beneficial qualities should strive to uphold the sublime Dharma.

source: བློ་གྲོས་རྒྱ་མཚོ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལ་མངོན་པར་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཚད་མེད་པར་འགྱུར་རོ། །
en: Sāgaramati, the distinct qualities of a bodhisattva who strives to uphold the sublime Dharma are limitless.”

source: དེ་བཞིན་གཤེགས་པའི་དམ་ཆོས་གང་འཛིན་པ། །དེ་དག་ཕན་ཡོན་རྣམ་པ་མང་འགྱུར་ཏེ། །
en: “Upholding the sublime Dharma of the Thus-Gone One Brings multifaceted benefits.

source: དེ་ལས་ཕྱོགས་ཙམ་ཡོངས་སུ་བརྗོད་པར་བྱ། །དཔེར་ན་རྒྱ་མཚོའི་ཆུ་ལས་ཐིགས་པ་བཞིན། །
en: Here I will state just a fraction of them, Like plucking a single drop of water from the ocean.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ནི་དེ་བཞིན་གཤེགས་ལ་བྱས་གཟོ་ཡིན། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Show their gratitude for thus-gone ones.

source: རྒྱལ་བ་རྣམས་ཀྱིས་མཛོད་འཛིན་ཡིད་བརྟན་ཞིང་། །ཕྱོགས་བཅུ་རྣམས་སུ་སངས་རྒྱས་མཆོད་པ་ཡིན། །
en: These reliable guards of the victors’ treasury Venerate the buddhas of the ten directions.

source: སངས་རྒྱས་སྤྱན་གྱིས་གཟིགས་པའི་ཞིང་མང་པོ། །རིན་ཆེན་བཀང་སྟེ་དེ་བཞིན་གཤེགས་ལ་ཕུལ། །ཟད་པའི་དུས་ན་ཇི་ལྟར་ཆོས་འཛིན་ལྟར། །བསོད་ནམས་ཕུང་པོ་དེ་ཙམ་འཕེལ་མ་ཡིན། །
en: “One may fill the many realms seen with buddha eyes With jewels and offer them to the Thus-Gone One, Yet that merit will eventually be exhausted and not increase, Unlike the mass of merit that comes from upholding the Dharma.

source: འཇིག་རྟེན་ཟང་ཟིང་རྒྱལ་ལ་བསྟི་སྟང་བྱས། །འཇིག་རྟེན་བྱེད་ལས་ནམ་ཡང་གྲོལ་མི་འགྱུར། །
en: “Material generosity, honoring the victors, And other mundane actions will never bring liberation.

source: འཇིག་རྟེན་འདས་པའི་ཆོས་ནི་གང་ཚོལ་བ། །མཁས་པ་དེ་ནི་འཇིག་རྟེན་ཆོས་ལས་འདའ། །
en: Yet, in seeking out the transcendental Dharma, The learned transcend worldly phenomena.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །རྒྱལ་བ་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བར་འགྱུར། །ལྷ་དང་ཀླུ་དང་མིའམ་ཅི་རྣམས་དང་། །བསོད་ནམས་ཡེ་ཤེས་ཀྱིས་ནི་ཡོངས་སུ་བཟུང་། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Are cared for by the victors, Just as they are cared for by the gods, nāgas, kinnaras, Merit, and wisdom.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དྲན་ལྡན་བློ་གྲོས་ལྡན་ཞིང་བློ་ལྡན་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Become mindful, intelligent, and wise.

source: ཤེས་རབ་རྒྱ་ཆེན་ཀུན་ནས་ཡེ་ཤེས་ལྡན། །
en: Their insight expands, and they possess all-embracing wisdom.

source: མཁས་པ་བག་ཆགས་བཅས་པའི་ཉོན་མོངས་སྤོང་། །
en: The learned discard afflictions and their habitual patterns.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ལ་བདུད་ཀྱི་སྐྱོན་ཆགས་རྙེད་མི་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Are free from faults in the eyes of the māras.

source: དེ་ལ་འགྱོད་དང་དེ་བཞིན་དོགས་པ་མེད། །དེ་ལ་བཅིངས་མེད་སྒྲིབ་པ་ཅུང་ཟད་མེད། །
en: They have no regret or worry, And eliminate all bondage and even the slightest obscuration.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །ཞིང་སྟོང་དག་ཏུ་ནམ་ཡང་མི་སྐྱེ་སྟེ། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Do not take rebirth in the many thousands of realms.

source: སྐྱེ་བ་ཀུན་ཏུ་དེ་ནི་རྒྱལ་བ་མཐོང་། །མཐོང་ནས་དེ་ལ་དད་པ་རབ་ཏུ་འཐོབ། །
en: They will behold the victors in all their lifetimes, And in seeing them, achieve faith.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །ཆོས་ཀྱི་བདག་ཉིད་ཆེན་པོ་སྐྱེ་དྲན་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Are great Dharma personages who recall previous lifetimes.

source: ཡང་དང་ཡང་དུ་རབ་ཏུ་འབྱུང་བ་འཐོབ། །
en: They go forth lifetime after lifetime.

source: སྤྱོད་པ་ཡོངས་དག་སྒྲུབ་པ་སྙིང་པོར་བྱེད། །
en: With their pure conduct they make their lives meaningful.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །ཚུལ་ཁྲིམས་ཐོས་པས་འཕགས་པའི་ཆོས་སྤྱོད་པ། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Study discipline and then practice the Dharma of the noble ones.

source: མཁས་པ་མངོན་ཤེས་ལྔ་ལ་མྱུར་དུ་རེག །མ་སྨད་བསམ་གཏན་རྣམ་པར་ཐར་པ་འཐོབ། །
en: The learned swiftly achieve the five super-knowledges, And attain excellent concentration and freedom.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ནི་ཟབ་ཆོས་རྟོགས་པར་ཁོང་དུ་ཆུད། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Master the realization of the profound Dharma.

source: སངས་རྒྱས་སྤྱོད་ཡུལ་སྟོང་ཉིད་ཐེ་ཚོམ་མེད། །
en: They have no doubt about emptiness—the buddhas’ experience.

source: སེམས་ཅན་བདག་མེད་པར་ཡང་མོས་པར་འགྱུར། །
en: They aspire to the selflessness of beings.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ནི་སོ་སོ་ཡང་དག་རིག་པ་འཐོབ། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Achieve the correct discriminations.

source: འཇིགས་མེད་ཤེས་རབ་རྣོ་ཞིང་ཆགས་མེད་དག །
en: They are fearless, have sharp insight, and no attachment.

source: དེ་ནི་སྲོག་ཆགས་ཀུན་གྱི་ཐེ་ཚོམ་གཅོད། །
en: They resolve the doubt of all beings.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །མཁས་པ་དེ་ནི་གཟུངས་རྣམས་འཐོབ་པར་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Are learned beings who achieve recollection.

source: བསྐལ་པ་བརྒྱར་ཡང་གང་ཐོས་ཆུད་མི་ཟ། །
en: They do not forget what they have heard even over a thousand eons.

source: སྤོབས་དང་ལྡན་ཞིང་ཆགས་པ་མེད་པར་འགྱུར། །
en: They lose all attachment and come to possess eloquence.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ལ་མཁས་པ་རྟག་ཏུ་དགའ་བར་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Always delight the learned.

source: ལྷ་དང་ལྷ་མིན་མི་ཅིའི་ཡིད་དུ་འོང་། །
en: They are pleasing to gods, nāgas, and kinnaras.

source: དེ་ལ་སངས་རྒྱས་བུ་གཅིག་བཞིན་དུ་བསྟོད། །
en: They are praised by the buddhas as if they were their only child.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །བརྒྱ་བྱིན་ཚངས་པ་དེ་བཞིན་འཇིག་རྟེན་སྐྱོང་། །འཁོར་ལོས་སྒྱུར་དང་མི་ཡི་རྒྱལ་པོར་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Become Śakra, Brahmā, world protectors, Universal monarchs, and the lords of humanity.

source: བདེ་དང་ཡིད་བདེ་བྱང་ཆུབ་དེ་འཚང་རྒྱ། །
en: They awaken to buddhahood in bliss and joy.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ལུས་སུམ་ཅུ་རྩ་གཉིས་མཚན་ལྡན་ཞིང་། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Will possess a body with the thirty-two marks.

source: མཁས་པ་ཡན་ལག་སྨད་པ་མེད་པར་འགྱུར། །
en: Even the limbs of these learned beings will be faultless.

source: དེ་ལ་ལྟ་བས་ངོམས་པར་ཡོང་མི་འགྱུར། །
en: One will never tire of gazing upon them.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །གང་དག་ཆོས་ཀྱི་ཕྱག་རྒྱ་འདི་སྟོན་པའི། །དགེ་བའི་བཤེས་གཉེན་དེ་ལ་དཀོན་མི་འགྱུར། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Will find no scarcity of spiritual friends To show them the Dharma seal.

source: ཆོས་མཛོད་ཟད་མི་ཤེས་པ་ཉན་པར་བྱེད། །
en: They will listen, never knowing the exhaustion of the Dharma treasury.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །ལུས་དང་ངག་དང་ཡིད་ཀྱང་རྣམ་པར་དག །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Will have pure body, speech, and mind.

source: ཚུལ་ཁྲིམས་ཏིང་འཛིན་ཤེས་རབ་རྣམ་པར་དག །རྣམ་གྲོལ་ཡེ་ཤེས་ཤིན་ཏུ་རྣམ་པར་དག །
en: Their discipline, absorption, and insight will be refined, And their liberation and wisdom will be pure.

source: དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་པ། །དེ་ནི་བྱང་ཆུབ་སེམས་བརྗེད་འགྱུར་བ་མེད། །
en: “Those who uphold the sublime Dharma of the Thus-Gone One Will never forget the mind of awakening.

source: ཕ་རོལ་ཕྱིན་པ་སྤྱོད་དང་འགལ་མི་འགྱུར། །
en: Their conduct will not contradict the perfections.

source: དགེ་བ་བརྒྱ་རྣམས་ཀྱིས་ཀྱང་རབ་ཏུ་བཟུང་། །
en: They will embrace hundreds of virtues.

source: དེ་དག་རྣམས་ཀྱི་ཡོན་ཏན་ཕན་ཡོན་རྣམས། །བསྐལ་པ་རྒྱུན་མི་འཆད་པར་རབ་བརྗོད་ཀྱང་། །དམ་ཆོས་འཛིན་པའི་ཕན་ཡོན་འདི་དག་ནི། །བརྗོད་པས་མཐའ་མར་ཕྱིན་པར་མི་འགྱུར་རོ། །
en: “Even if the beneficial qualities of these bodhisattvas Were continuously described for an eon, The benefits of upholding the Dharma Could never be fully described.”

source: སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: [Chapter Six: Teaching on the Qualities of Buddhahood]

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བ། ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the bodhisattva great being Light King of Qualities, who was seated amongst the assembly, addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ཀྱིས་ངས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བརྗོད་དུ་མེད་དོ་ཞེས་གསུངས་ན།
en: “Blessed One, you have said that all phenomena that you understand are indescribable.

source: བཅོམ་ལྡན་འདས་ཆོས་བརྗོད་དུ་མ་མཆིས་པ་ལགས་ན་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བ་ཇི་ལྟ་བུ་ཞིག་ལགས།
en: In that case, Blessed One, since all phenomena are indescribable, how is the Dharma to be upheld?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །
en: “Noble son,” answered the Blessed One, “that is true.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: You have described it accurately.

source: ཆོས་གང་ངས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བརྗོད་དུ་མེད་དོ། །
en: Any phenomenon that I understand is indescribable.

source: རིགས་ཀྱི་བུ་འོན་ཀྱང་ཡི་གེའི་ངེས་པའི་ཚིག་གང་དག་གིས་བརྗོད་དུ་མེད་པ་འདུས་མ་བྱས་ཀྱི་ཆོས་དེ་བསྙད་པའི་ཡི་གེའི་ངེས་པའི་ཚིག་དེ་དག་གང་ལེན་པ་དང་འཛིན་པ་དང་སྟོན་པ་དང་། རབ་ཏུ་ཤེས་པར་བྱེད་པ་དང་། འཇོག་པ་དང་རྣམ་པར་འགྲེལ་པ་དང་། རྣམ་པར་འབྱེད་པ་དང་གསལ་བར་བྱེད་པ་དང་། ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱའོ། །
en: However, noble son, while all phenomena are indescribable and unconditioned, using linguistic definitions to apprehend, perceive, teach, demonstrate, define, elucidate, distinguish, clarify, or teach such phenomena is what is meant by upholding the Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་སྨྲ་བ་གང་དག་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་འཛིན་པ་དང་། སྟོན་པ་དང་། སྒྲུབ་པའི་ཆོས་སྨྲ་བ་དེ་དག་ལ་གང་བསྙེན་པ་དང་། བསྟེན་པ་དང་། བསྙེན་བཀུར་བྱེད་པ་དང་། ལྡང་བ་དང་། རིམ་གྲོ་བྱེད་པ་དང་། གུས་པར་བྱེད་པ་དང་། ཞེ་ས་བྱེད་པ་དང་། བསྟི་སྟང་བྱེད་པ་དང་། ཀུན་ཏུ་སྲུང་བ་དང་། སྦེད་པ་དང་། ཡོངས་སུ་འཛིན་པ་དང་།
en: Moreover, noble son, when Dharma teachers uphold, teach, or practice a sūtra such as this, that is also upholding the Dharma. Likewise, when others attend such Dharma teachers and rely upon them while extending them honor, reverence, service, respect, praise, care, protection, shielding, and shelter, that is also upholding the Dharma.

source: གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་སྦྱིན་པ་དང་། ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པ་དང་། རྗེ་བོ་ལྟར་ཀུན་ཏུ་སྲུང་བ་དང་། དགེ་བ་ཀུན་ཏུ་སྲུང་བ་དང་། བསྔགས་པ་བརྗོད་པ་དང་། མི་སྙན་པ་འཆབ་པ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Likewise, so is providing them with clothing, food, bedding, medicine, or provisions; as is offering them approval, protection, preservation of their virtues, praise, or concealment of their unflattering sides.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། མཚན་མ་མེད་པ་ལ་ཡིད་ཆེས་པ་དང་། སྨོན་པ་མེད་པ་ལ་སོམ་ཉི་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་དེ་ཁོ་ན་ཉིད་དུ་ངེས་པར་སེམས་པ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Moreover, noble son, having faith in emptiness, trusting signlessness, believing in wishlessness, and gaining certainty that suchness is the unconditioned state is also upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་རྩོད་པ་མེད་པ་ལྷུར་ལེན་པ་དང་། ཆོས་མ་ཡིན་པས་རྩོད་པ་རྣམས་ཆོས་དང་འཐུན་པས་ཚར་གཅོད་པ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Moreover, noble son, seeking to avoid debate, yet using proper Dharma arguments to defeat those who argue against the Dharma, is also upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཞེ་སྡང་མེད་པའི་རྒྱུད་དང་། སེམས་ཅན་བསྡུ་བ་དང་རབ་ཏུ་ཐར་བར་བྱ་བའི་བློ་དང་། ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་གཞན་དག་ལ་ཆོས་སྦྱིན་པ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Moreover, noble son, giving Dharma to others with a mind free of anger, an intention to gather and free beings, and a mind free of concern for material things, is also upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ལུས་དང་སྲོག་འདོར་ཞིང་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་ཀུན་ཏུ་སྲུང་བ་དང་། སྦེད་པ་དང་། སྒྲུབ་པར་དགོན་པ་ལ་གནས་པ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Moreover, noble son, disregarding one’s body and life and staying in solitude to preserve, conceal, and practice sūtras such as this is also upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་ཆོས་མཉན་པའི་རྒྱུ་ལས་བྱུང་བའམ། ཆོས་བསྟན་པའི་རྒྱུ་ལས་བྱུང་བས་ཐ་ན་གོམ་པ་གཅིག་འདོར་རམ། ཐ་ན་དབུགས་འབྱིན་པའམ་རྔུབ་པ་གཅིག་ཀྱང་རུང་སྟེ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Moreover, noble son, even a single step or a single inhalation or exhalation of the breath that comes from the cause of having either studied or taught the Dharma is also upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མི་འཛིན་ཅིང་མི་ལེན་པ་འདི་ཡང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱའོ། །
en: Moreover, noble son, not grasping to or appropriating any phenomena is also upholding the sublime Dharma.

source: ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱའོ། །
en: Light King of Qualities, based on this explanation, you should understand this point.

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན། དགའ་བ་འཕགས་པའི་བསྐལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་འོད་རྣམ་པར་དག་པར་བཅོམ་ལྡན་འདས་ཡེ་ཤེས་ཆེན་པོའི་སྟོབས་བསྒྲགས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་
en: “Noble son, countless eons ago in the past, in the eon called Noble Bliss, in the world Pure Light there was a thus-gone, worthy, perfect buddha named Teacher of the Power of Great Wisdom.

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: He was learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans, and a blessed buddha.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འོད་རྣམ་པར་དག་པ་དེ་ནི་བཻ་དཱུརྱ་ལས་གྲུབ་པ། ཤིན་ཏུ་རྣམ་པར་དག་པ།
en: Noble son, the world Pure Light was made of beryl and was incredibly pure.

source: ཕྱོགས་བཅུ་སྣང་བས་རྒྱས་པར་འགེངས་པ།
en: A light filled the ten directions.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་ཆེན་པོའི་སྟོབས་ཀྱིས་རྣམ་པར་རྩེན་པ།
en: The bodhisattva great beings there played in the great power of super-knowledge.

source: ཆོས་ཟབ་མོ་ལ་ངེས་པར་བྱུང་བ་ཉི་ཚེའི་གནས་སུ་གྱུར་པའོ། །
en: It was a place where everyone was freed within the profound Dharma.

source: དེའི་ཚེ་སེམས་ཅན་དེ་དག་གི་ལོངས་སྤྱོད་ནི་ལྷའི་བུ་རབ་འཕྲུལ་གྱི་དང་འདྲ་བར་གྱུར་ཅིང་ལྷའི་བུའི་གཟུགས་ཉིད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་ཆོས་ཉན་ཏོ། །
en: Their enjoyments were like those of the god Sunirmita, and in their divine bodies they listened to the Dharma of that Blessed One.

source: དེ་ན་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་ཐ་དད་དུ་བྱ་བ་མེད་དོ། །
en: In that realm, householders and monastics were not involved in distinct activities.

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་ཆེན་པོའི་སྟོབས་བསྒྲགས་པའི་དེ་བཞིན་གཤེགས་པ་དེས་རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་ལུས་སྲོག་འདོར་ཞིང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: The blessed thus-gone Teacher of the Power of Great Wisdom advised everyone to strive to uphold the sublime Dharma without any concern for body or life.

source: ཞེས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་གཏམ་ཉིད་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: In this way he gave extensive advice for upholding the sublime Dharma.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སྨྲ་བ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ །
en: “At that point the bodhisattva great being Dharma Teacher was present in the assembly.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཡེ་ཤེས་ཆེན་པོའི་སྟོབས་བསྒྲགས་པའི་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སྨྲ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He asked the blessed thus-gone Teacher of the Power of Great Wisdom,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས།
en: ‘Blessed One, how should bodhisattvas uphold the sublime Dharma?

source: བྱང་ཆུབ་སེམས་དཔས་གང་ཡོངས་སུ་གཟུང་བར་བགྱི་བའི་ཆོས་དེ་གང་ལགས།
en: Which Dharma should bodhisattvas uphold?’

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་ཆེན་པོའི་སྟོབས་བསྒྲགས་པའི་དེ་བཞིན་གཤེགས་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྨྲ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “The blessed thus-gone Teacher of the Power of Great Wisdom then said to the bodhisattva Dharma Teacher ,

source: རིགས་ཀྱི་བུ་ཀྱེ་མའོ་སེམས་འདི་ནི་ཡུལ་ལ་རབ་ཏུ་འཕྱར་བ་སྟེ།
en: ‘Alas, noble son, this mind leaps at objects.

source: གང་དེ་ཟློག་པ་དང་། ཡོངས་སུ་སྲུང་བ་དང་། རྩེ་གཅིག་ཏུ་འགྱུར་བ་དང་། དུལ་བ་དང་། ཞི་བ་དང་། ཉེ་བར་ཞི་བ་དང་འདུལ་བ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱའོ། །
en: So, to reverse and guard against this, focusing the mind and becoming disciplined, peaceful, tranquil, and gentle is to uphold the sublime Dharma.

source: མིག་དང་། གཟུགས་རྣམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ཆོས་མ་ཡིན་པ་འདི་ནི་ཆོས་མ་ཡིན་པའོ། །
en: The eye, forms, and visual consciousness are not the Dharma.

source: རྣ་བ་དང་། སྒྲ་རྣམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་།
en: The ear, sounds, and auditory consciousness;

source: སྣ་དང་། དྲི་རྣམས་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་།
en: the nose, smells, and olfactory consciousness;

source: ལུས་དང་། རེག་བྱ་རྣམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་།
en: the body, objects of touch, and tactile consciousness;

source: ཡིད་དང་། ཆོས་རྣམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ཆོས་མ་ཡིན་པ་འདི་ནི་ཆོས་མ་ཡིན་པའོ། །
en: and the mind, mental phenomena, and mental consciousness are not the Dharma.

source: གང་མིག་དང་གཟུགས་སྟོང་པར་རིག་ནས་མིག་དང་གཟུགས་རྣམས་ལ་རྣམ་པར་མི་རྟོག་ཅིང་མིག་གི་རྣམ་པར་ཤེས་པ་ལ་གནས་པ་མེད་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: So, upholding the sublime Dharma is recognizing the eye and form to be empty, and neither thinking about the eye or form, nor maintaining visual consciousness.

source: གང་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱིས་དེ་གཞན་དག་ལ་གོ་བར་བྱེད་པ་ལ་མཁས་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Skillfully using pure wisdom to help others understand this is to uphold the sublime Dharma.

source: དེ་བཞིན་དུ་རྣ་བ་དང་། སྒྲ་དང་སྣ་དང་། དྲི་དང་ལྕེ་དང་། རོ་དང་ལུས་དང་། རེག་བྱ་དང་ཡིད་དང་། ཆོས་རྣམ་སྟོང་པར་རིག་ནས་ཡིད་དང་ཆོས་རྣམས་ལ་རྣམ་པར་མི་རྟོག་ཅིང་ཡིན་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་གནས་པ་མེད་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Likewise, upholding the sublime Dharma is recognizing the ear and sounds, nose and smells, tongue and tastes, body and objects of touch, and mind and mental phenomena to be empty, and neither thinking about them, nor maintaining their corresponding consciousnesses.

source: དེ་ཡང་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱི་གཞན་དག་ལ་གོ་བར་བྱེད་པ་ལ་མཁས་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Skillfully using pure wisdom to help others understand this is upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་གང་གིས་ཆོས་གང་བྱུང་བའི་ཆོས་དེ་ལ་ཡོངས་སུ་མི་འཛིན་པ་དང་། མི་ལེན་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Moreover, not grasping at or appropriating any phenomena that occur is upholding the sublime Dharma.
